app/Controllers/BukuController.php

    public function index()
    {
        $data = [
            'title' => 'Subjects Management',
            'page_title' => 'Subjects List',
            'bukus' => $this->BukuModel->findAll()
---
SELECT *
FROM `buku`