app/Controllers/GuruController.php

SELECT *
FROM `guru`
---
    public function index()
    {
        $data = [
            'title' => 'Teachers Management',
            'page_title' => 'Teachers List',
            'gurus' =>$this->GuruModel->findAll()

SELECT *
FROM `guru`
WHERE `guru`.`id` = '3'
---
    public function edit($guru_id)
    {
        $data = [
            'title' => 'Teachers Management',
            'page_title' => 'Edit Teachers',
            'gurus' => $this->GuruModel->find($guru_id)

UPDATE `guru` SET `guru` = 'pi'
WHERE `guru`.`id` IN ('3')
---
    public function update()
    {
        $guru_id = $this->request->getPost('guru_id');
        $guru = $this->request->getPost('guru');

        $edit_guru = [
            'guru' => $guru,
        ];

        $update_guru = $this->GuruModel->update($guru_id, $edit_guru);

DELETE FROM `guru`
WHERE `id` IN ('3')
---
    public function delete($guru_id)
    {
        $this->GuruModel->delete($guru_id);