app/Controllers/JadwalController.php

SELECT `jadwal`.*, `mapel`.`nama_pelajaran`, `guru`.`guru`
FROM `jadwal`
JOIN `mapel` ON `mapel`.`id` = `jadwal`.`nama_pelajaran_id`
JOIN `guru` ON `guru`.`id` = `jadwal`.`guru_id`
---
    public function index()
    {
        $jadwals = $this->JadwalModel->select('jadwal.*,buku.nama_pelajaran,guru.guru')
        ->join('buku','buku.id = jadwal.nama_pelajaran_id')
        ->join('guru','guru.id = jadwal.guru_id')->findAll();

SELECT *
FROM `buku`
SELECT *
FROM `guru`
---
    public function create()
    {
        $data = [
            'title' => 'Lesson Timetable Management',
            'page_title' => 'Create List Lesson Timetable',
            'bukus' => $this->BukuModel->findAll(),
            'gurus' =>$this->GuruModel->findAll(),

INSERT INTO `jadwal` (`nama_pelajaran_id`, `deskripsi`, `total_jam`, `guru_id`) VALUES ('2', 'ilmu', '3 jam', '2')
---
    public function store()
    {
        $nama_pelajaran = $this->request->getPost('nama_pelajaran');
        $deskripsi = $this->request->getPost('deskripsi');
        $total_jam = $this->request->getPost('total_jam');
        $guru = $this->request->getPost('guru');

        $new_jadwal = [
            'nama_pelajaran_id' => $nama_pelajaran,
            'deskripsi' => $deskripsi,
            'total_jam' => $total_jam,
            'guru_id' => $guru,
        ];

        $insert_jadwal = $this->JadwalModel->insert($new_jadwal);

SELECT *
FROM `jadwal`
WHERE `jadwal`.`id` = '1'
SELECT *
FROM `guru`
---
    public function edit($jadwal_id)
    {
        $data = [
            'title' => 'Lesson Timetable Management',
            'page_title' => 'Edit Lesson Timetable',
            'jadwal' => $this->JadwalModel->find($jadwal_id),
            'bukus' => $this->BukuModel->findAll(),
            'gurus' => $this->GuruModel->findAll(),