app/Controllers/JadwalController.php

    public function edit($jadwal_id)
    {
        $data = [
            'title' => 'Lesson Timetable Management',
            'page_title' => 'Edit Lesson Timetable',
            'jadwal' => $this->JadwalModel->find($jadwal_id),
            'mapels' => $this->MapelModel->findAll(),
---
SELECT *
FROM `mapel`