app/Controllers/MapelController.php

    public function index()
    {
        $data = [
            'title' => 'Subjects Management',
            'page_title' => 'Subjects List',
            'mapels' => $this->MapelModel->findAll()
---
SELECT *
FROM `mapel`