app/Controllers/Mata_PelajaranController.php

    public function index()
    {
        $data = [
            'title' => 'Mata Pelajaran Management',
            'page_title' => 'List Mata Pelajaran',
            'mata_pelajarans' => $this->Mata_PelajaranModel->findAll()
---
SELECT *
FROM `mata_pelajaran`

    public function store()
    {
        $nama_pelajaran = $this->request->getPost('nama_pelajaran');
        $deskripsi = $this->request->getPost('deskripsi');
        $total_jam = $this->request->getPost('total_jam');
        $guru = $this->request->getPost('guru');

        $new_mata_pelajaran = [
            'nama_pelajaran' => $nama_pelajaran,
            'deskripsi' => $deskripsi,
            'total_jam' => $total_jam,
            'guru' => $guru,
        ];

        $insert_mata_pelajaran = $this->Mata_PelajaranModel->insert($new_mata_pelajaran);
---
INSERT INTO `mata_pelajaran` (`nama_pelajaran`, `deskripsi`, `total_jam`, `guru`) VALUES ('IPA', 'berhubungan dengan alam', '1 jam', 'sahrul')

    public function edit($mata_pelajaran_id)
    {
        $data = [
            'title' => 'Mata Pelajaran Management',
            'page_title' => 'Edit Mata Pelajaran',
            'mata_pelajaran' => $this->Mata_PelajaranModel->find($mata_pelajaran_id)
---
SELECT *
FROM `mata_pelajaran`
WHERE `mata_pelajaran`.`id` = '4'

    public function update()
    {
        $mata_pelajaran_id = $this->request->getPost('mata_pelajaran_id');
        $nama_pelajaran = $this->request->getPost('nama_pelajaran');
        $deskripsi = $this->request->getPost('deskripsi');
        $total_jam = $this->request->getPost('total_jam');
        $guru = $this->request->getPost('guru');

        $edit_mata_pelajaran = [
            'nama_pelajaran' => $nama_pelajaran,
            'deskripsi' => $deskripsi,
            'total_jam' => $total_jam,
            'guru' => $guru,
        ];

        $update_mata_pelajaran = $this->Mata_PelajaranModel->update($mata_pelajaran_id, $edit_mata_pelajaran);
---
UPDATE `mata_pelajaran` SET `nama_pelajaran` = 'IPS', `deskripsi` = 'IPS merupakan ilmu pengetahuan yang berkaitan dengan lingkungan sosial, cabang ilmu pengetahuan yang mempelajari tingkah laku manusia sebagai anggota masyarakat.', `total_jam` = '6 jam', `guru` = 'budi'
WHERE `mata_pelajaran`.`id` IN ('4')

    public function delete($mata_pelajaran_id)
    {
        $this->Mata_PelajaranModel->delete($mata_pelajaran_id);
---
DELETE FROM `mata_pelajaran`
WHERE `id` IN ('5')